#!/usr/bin/env ruby
# Util::IsoLatin1 -- oddb -- 05.01.2006 -- hwyss@ywesee.com

module ODDB
  module Util
    module IsoLatin1
      DOWNCASE_PAIRS = [
        ["Å", "å"], ["Æ", "æ"], ["Ä", "ä"], ["Á", "á"], ["Â", "â"],
        ["À", "à"], ["Ã", "ã"], ["Ą", "ą"], ["Ǎ", "ǎ"], ["Ă", "ă"],
        ["Ā", "ā"], ["Ȧ", "ȧ"], ["Ḃ", "ḃ"], ["Ç", "ç"], ["Ĉ", "ĉ"],
        ["Č", "č"], ["Ć", "ć"], ["Ċ", "ċ"], ["Ḑ", "ḑ"], ["Đ", "đ"],
        ["Ð", "ð"], ["Ď", "ď"], ["Ḋ", "ḋ"], ["Ë", "ë"], ["É", "é"],
        ["Ê", "ê"], ["È", "è"], ["Ȩ", "ȩ"], ["Ę", "ę"], ["Ě", "ě"],
        ["Ĕ", "ĕ"], ["Ẽ", "ẽ"], ["Ē", "ē"], ["Ė", "ė"], ["Þ", "þ"],
        ["Ḟ", "ḟ"], ["Ģ", "ģ"], ["Ǧ", "ǧ"], ["Ğ", "ğ"], ["Ǵ", "ǵ"],
        ["Ĝ", "ĝ"], ["Ḡ", "ḡ"], ["Ġ", "ġ"], ["Ȟ", "ȟ"], ["Ĥ", "ĥ"],
        ["Ḧ", "ḧ"], ["Ḩ", "ḩ"], ["Ḣ", "ḣ"], ["Ï", "ï"], ["Í", "í"],
        ["Î", "î"], ["Ì", "ì"], ["Į", "į"], ["Ǐ", "ǐ"], ["Ĭ", "ĭ"],
        ["Ĩ", "ĩ"], ["İ", "ı"], ["Ĵ", "ĵ"], ["Ǩ", "ǩ"], ["Ḱ", "ḱ"],
        ["Ķ", "ķ"], ["Ł", "ł"], ["Ĺ", "ĺ"], ["Ľ", "ľ"], ["Ļ", "ļ"],
        ["Ḿ", "ḿ"], ["Ṁ", "ṁ"], ["Ň", "ň"], ["Ń", "ń"], ["Ñ", "ñ"],
        ["Ǹ", "ǹ"], ["Ņ", "ņ"], ["Ṅ", "ṅ"], ["Œ", "œ"], ["Ö", "ö"],
        ["Ó", "ó"], ["Ô", "ô"], ["Ò", "ò"], ["Õ", "õ"], ["Ō", "ō"],
        ["Ŏ", "ŏ"], ["Ø", "ø"], ["Ǫ", "ǫ"], ["Ǒ", "ǒ"], ["Ȯ", "ȯ"],
        ["Ṕ", "ṕ"], ["Ṗ", "ṗ"], ["Ř", "ř"], ["Ŕ", "ŕ"], ["Ŗ", "ŗ"],
        ["Ṙ", "ṙ"], ["Ś", "ś"], ["Ŝ", "ŝ"], ["Š", "š"], ["Ş", "ş"],
        ["Ṡ", "ṡ"], ["Ť", "ť"], ["Ţ", "ţ"], ["Ṫ", "ṫ"], ["Ü", "ü"],
        ["Ú", "ú"], ["Û", "û"], ["Ù", "ù"], ["Ų", "ų"], ["Ǘ", "ǘ"],
        ["Ǔ", "ǔ"], ["Ǚ", "ǚ"], ["Ǜ", "ǜ"], ["Ũ", "ũ"], ["Ŭ", "ŭ"],
        ["Ů", "ů"], ["Ǖ", "ǖ"], ["Ṽ", "ṽ"], ["Ẃ", "ẃ"], ["Ŵ", "ŵ"],
        ["Ẁ", "ẁ"], ["Ẅ", "ẅ"], ["Ẇ", "ẇ"], ["Ẍ", "ẍ"], ["Ẋ", "ẋ"],
        ["Ÿ", "ÿ"], ["Ẏ", "ẏ"], ["Ỹ", "ỹ"], ["Ỳ", "ỳ"], ["Ŷ", "ŷ"],
        ["Ý", "ý"], ["Ȳ", "ȳ"], ["Ž", "ž"], ["Ź", "ź"], ["Ẑ", "ẑ"],
        ["Ż", "ż"]
      ]
      def locale_downcase!
        DOWNCASE_PAIRS.each do |search, replace|
          self.gsub! search, replace
        end
      end
    end
  end
end

class String
	unless instance_methods.include?('_downcase')
		include ODDB::Util::IsoLatin1
		alias :_downcase :downcase
		alias :_downcase! :downcase!
		def downcase
			res = _downcase
			res.locale_downcase!
			res
		end
		def downcase!
			res = _downcase!
			locale_downcase! || res
		end
	end
end
